### SQL number

In [1]:
import pandas as pd 
import sqlite3

#### typeof

```SQL
SELECT TYPEOF( 1 + 1 );
SELECT TYPEOF( 1 + 1.0 );
SELECT TYPEOF('panda');
SELECT TYPEOF('panda' + 'koala');
```

In [3]:
con = sqlite3.connect("data/world.db")

pd.read_sql('SELECT TYPEOF( 1 + 1 )', con)

  TYPEOF( 1 + 1 )
0         integer

#### INTEGER division

```SQL
SELECT 1 / 2;
SELECT 1.0 / 2;
SELECT CAST(1 AS REAL) / 2;
SELECT 17 / 5;
SELECT 17 / 5, 17 % 5;
```

In [4]:
pd.read_sql('SELECT 1.0 / 2;', con)

   1.0 / 2
0      0.5

####  ROUND()

```SQL
SELECT 2.55555;
SELECT ROUND(2.55555);
SELECT ROUND(2.55555, 3);
SELECT ROUND(2.55555, 0);
```

In [5]:
pd.read_sql('SELECT ROUND(2.55555);', con)

   ROUND(2.55555)
0             3.0